In [9]:
import pandas as pd 
import numpy as np
import datetime as datetime
import unidecode as unidecode
import pyarrow

In [4]:
pd.options.display.max_columns=None

# CARGAR DATOS

In [17]:
df1=pd.read_csv('C:/Users/soyju/Downloads/PRICNIPIOS M&S/INTRODUCCION A PHYTON/INTRODUCCION/DatosExcel/datos_cliente1.csv',sep=';',encoding='latin-1')
df1.head(4)

,Unnamed: 0,id_cliente,nombre,apellidoS,FECHA NACIMIENTO,ciudad,fecha_registro,ultima_compra
0,0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022
2,2,3.0,Pedro,Pérez,10/06/1976,Cartagena,22/02/2022,04/04/2022
3,3,4.0,Juan,López,17/04/1993,Cartagena,25/01/2022,07/03/2022

In [18]:
df2=pd.read_csv('C:/Users/soyju/Downloads/PRICNIPIOS M&S/INTRODUCCION A PHYTON/INTRODUCCION/DatosExcel/datos_cliente2.csv',sep=';',encoding='latin-1')
df2.head(4)

,Unnamed: 0,id_orden,id_cliente,Producto,monto DE COMPRA,Fecha orden,Identificacionn,tipo venta,REGION
0,0,1001,273.0,A,300.70,31/10/2022,43453698.0,presencial,Este
1,1,1002,1468.0,B,106.56,07/06/2021,27299420.0,online,Norte
2,2,1003,NaN,E,133.42,02/04/2021,23461449.0,online,Este
3,3,1004,NaN,C,65.44,07/12/2020,15328088.0,presencial,Este

In [19]:
df3=pd.read_csv('C:/Users/soyju/Downloads/PRICNIPIOS M&S/INTRODUCCION A PHYTON/INTRODUCCION/DatosExcel/datos_cliente3.csv',sep=';',encoding='latin-1')
df3.head(4)

   Unnamed: 0  id_orden  tipo_venta REGION DE VENTA  porcentaje_pago
0           0      1001  presencial            Este              8.0
1           1      1002      online           Norte             12.0
2           2      1003      online            Este             10.0
3           3      1004  presencial            Este              8.0

In [20]:
print(df1.shape)
print(df2.shape)
print(df3.shape)

(2500, 8)
(2500, 9)
(2500, 5)

# CONOCER DATOS

In [21]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 0 to 2499
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        2500 non-null   int64
 1   id_cliente        2400 non-null   float64
 2   nombre            2400 non-null   object
 3   apellidoS         2400 non-null   object
 4   FECHA NACIMIENTO  2400 non-null   object
 5   ciudad            2299 non-null   object
 6   fecha_registro    2400 non-null   object
 7   ultima_compra     2400 non-null   object
dtypes: float64(1), int64(1), object(6)
memory usage: 156.4+ KB

In [22]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 0 to 2499
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       2500 non-null   int64
 1   id_orden         2500 non-null   int64
 2   id_cliente       2406 non-null   float64
 3   Producto         2500 non-null   object
 4   monto DE COMPRA  2399 non-null   float64
 5   Fecha orden      2399 non-null   object
 6   Identificacionn  2500 non-null   float64
 7   tipo venta       2500 non-null   object
 8   REGION           2500 non-null   object
dtypes: float64(3), int64(2), object(4)
memory usage: 175.9+ KB

In [23]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 0 to 2499
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       2500 non-null   int64
 1   id_orden         2500 non-null   int64
 2   tipo_venta       2500 non-null   object
 3   REGION DE VENTA  2500 non-null   object
 4   porcentaje_pago  2500 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 97.8+ KB

In [24]:
nulos1=df1.isnull().sum()
nulos1

Unnamed: 0            0
id_cliente          100
nombre              100
apellidoS           100
FECHA NACIMIENTO    100
ciudad              201
fecha_registro      100
ultima_compra       100
dtype: int64

In [25]:
nulos2=df2.isnull().sum()
nulos2

Unnamed: 0           0
id_orden             0
id_cliente          94
Producto             0
monto DE COMPRA    101
Fecha orden        101
Identificacionn      0
tipo venta           0
REGION               0
dtype: int64

In [26]:
nulos3=df3.isnull().sum()
nulos3

Unnamed: 0         0
id_orden           0
tipo_venta         0
REGION DE VENTA    0
porcentaje_pago    0
dtype: int64

# AJUSTAR VARIABLES

In [104]:
df1.columns

Index(['Unnamed: 0', 'id_cliente', 'nombre', 'apellidoS   ',
       'FECHA NACIMIENTO', 'ciudad', 'fecha_registro  ', 'ultima_compra'],
      dtype='object')

In [105]:
df1['fecha_registro  ']

0       19/01/2022
1       21/01/2022
2       22/02/2022
3       25/01/2022
4       15/02/2022
           ...
2495    04/01/2022
2496    12/03/2022
2497    16/03/2022
2498    04/01/2022
2499    19/01/2022
Name: fecha_registro  , Length: 2500, dtype: object

In [163]:
df1_rename=df1.rename(columns={'apellidoS   ':'apellidos','FECHA NACIMIENTO':'fecha_nacimiento',
                            'fecha_registro  ':'fecha_registro'})

In [164]:
df1_rename.head(2)

,Unnamed: 0,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra
0,0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022

In [108]:
df2.columns

Index(['Unnamed: 0', 'id_orden', 'id_cliente', 'Producto', 'monto DE COMPRA',
       'Fecha orden', 'Identificacionn', 'tipo venta', 'REGION'],
      dtype='object')

In [181]:
df2_rename=df2.rename(columns={'Producto':'producto','monto DE COMPRA':'monto_de_compra',
                            'Fecha orden':'fecha_orden','Identificacionn':'identificacion',
                            'tipo venta':'tipo_venta','REGION':'region'})
df2_rename

,Unnamed: 0,id_orden,id_cliente,producto,monto_de_compra,fecha_orden,identificacion,tipo_venta,region
0,0,1001,273.0,A,300.70,31/10/2022,43453698.0,presencial,Este
1,1,1002,1468.0,B,106.56,07/06/2021,27299420.0,online,Norte
2,2,1003,NaN,E,133.42,02/04/2021,23461449.0,online,Este
3,3,1004,NaN,C,65.44,07/12/2020,15328088.0,presencial,Este
4,4,1005,NaN,A,338.98,27/04/2023,90319318.0,presencial,Oeste
...,...,...,...,...,...,...,...,...,...
2495,2495,3496,245.0,E,312.81,25/04/2022,74480627.0,online,Norte
2496,2496,3497,513.0,B,278.91,18/06/2024,81810460.0,online,Norte
2497,2497,3498,NaN,C,80.55,27/05/2024,18684931.0,venta telefónica,Norte
2498,2498,3499,896.0,A,93.44,16/02/2020,76712135.0,presencial,Sur
2499,2499,3500,2234.0,B,211.20,13/09/2021,33523570.0,online,Sur

In [182]:
df2_rename.head(4)

,Unnamed: 0,id_orden,id_cliente,producto,monto_de_compra,fecha_orden,identificacion,tipo_venta,region
0,0,1001,273.0,A,300.70,31/10/2022,43453698.0,presencial,Este
1,1,1002,1468.0,B,106.56,07/06/2021,27299420.0,online,Norte
2,2,1003,NaN,E,133.42,02/04/2021,23461449.0,online,Este
3,3,1004,NaN,C,65.44,07/12/2020,15328088.0,presencial,Este

In [111]:
df3.columns

Index(['Unnamed: 0', 'id_orden', 'tipo_venta', 'REGION DE VENTA',
       'porcentaje_pago'],
      dtype='object')

In [112]:
df3_rename=df3.rename(columns={'REGION DE VENTA':'region_de_venta'})

In [113]:
df3_rename.head(4)

   Unnamed: 0  id_orden  tipo_venta region_de_venta  porcentaje_pago
0           0      1001  presencial            Este              8.0
1           1      1002      online           Norte             12.0
2           2      1003      online            Este             10.0
3           3      1004  presencial            Este              8.0

# EXPLORACIÓN DE DATOS

In [165]:
df1_rename.head(5)

,Unnamed: 0,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra
0,0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022
2,2,3.0,Pedro,Pérez,10/06/1976,Cartagena,22/02/2022,04/04/2022
3,3,4.0,Juan,López,17/04/1993,Cartagena,25/01/2022,07/03/2022
4,4,5.0,Elena,Pérez,21/07/2000,Barranquilla,15/02/2022,28/03/2022

In [183]:
df2_rename.head(5)

,Unnamed: 0,id_orden,id_cliente,producto,monto_de_compra,fecha_orden,identificacion,tipo_venta,region
0,0,1001,273.0,A,300.70,31/10/2022,43453698.0,presencial,Este
1,1,1002,1468.0,B,106.56,07/06/2021,27299420.0,online,Norte
2,2,1003,NaN,E,133.42,02/04/2021,23461449.0,online,Este
3,3,1004,NaN,C,65.44,07/12/2020,15328088.0,presencial,Este
4,4,1005,NaN,A,338.98,27/04/2023,90319318.0,presencial,Oeste

In [184]:
df2_rename['identificacion']=df2_rename['identificacion'].astype(str).str.replace('.0','')
df2_rename

,Unnamed: 0,id_orden,id_cliente,producto,monto_de_compra,fecha_orden,identificacion,tipo_venta,region
0,0,1001,273.0,A,300.70,31/10/2022,43453698,presencial,Este
1,1,1002,1468.0,B,106.56,07/06/2021,27299420,online,Norte
2,2,1003,NaN,E,133.42,02/04/2021,23461449,online,Este
3,3,1004,NaN,C,65.44,07/12/2020,15328088,presencial,Este
4,4,1005,NaN,A,338.98,27/04/2023,90319318,presencial,Oeste
...,...,...,...,...,...,...,...,...,...
2495,2495,3496,245.0,E,312.81,25/04/2022,74480627,online,Norte
2496,2496,3497,513.0,B,278.91,18/06/2024,81810460,online,Norte
2497,2497,3498,NaN,C,80.55,27/05/2024,18684931,venta telefónica,Norte
2498,2498,3499,896.0,A,93.44,16/02/2020,76712135,presencial,Sur
2499,2499,3500,2234.0,B,211.20,13/09/2021,33523570,online,Sur

In [185]:
df1_drop=df1_rename.drop('Unnamed: 0',axis=1)
df2_drop=df2_rename.drop('Unnamed: 0',axis=1)
df3_drop=df3_rename.drop('Unnamed: 0',axis=1)

In [186]:
df1_drop

,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra
0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022
2,3.0,Pedro,Pérez,10/06/1976,Cartagena,22/02/2022,04/04/2022
3,4.0,Juan,López,17/04/1993,Cartagena,25/01/2022,07/03/2022
4,5.0,Elena,Pérez,21/07/2000,Barranquilla,15/02/2022,28/03/2022
...,...,...,...,...,...,...,...
2495,2496.0,Luis,Pérez,18/02/1982,Cartagena,04/01/2022,17/03/2022
2496,2497.0,Ana,Rodríguez,19/05/2001,Bogotá,12/03/2022,07/01/2022
2497,2498.0,Elena,López,13/08/1959,Bogotá,16/03/2022,14/03/2022
2498,2499.0,Rosa,Rodríguez,09/06/1954,Cali,04/01/2022,23/03/2022
2499,2500.0,Pedro,Gómez,18/05/1979,Bogotá,19/01/2022,21/01/2022

In [187]:
df2_drop

,id_orden,id_cliente,producto,monto_de_compra,fecha_orden,identificacion,tipo_venta,region
0,1001,273.0,A,300.70,31/10/2022,43453698,presencial,Este
1,1002,1468.0,B,106.56,07/06/2021,27299420,online,Norte
2,1003,NaN,E,133.42,02/04/2021,23461449,online,Este
3,1004,NaN,C,65.44,07/12/2020,15328088,presencial,Este
4,1005,NaN,A,338.98,27/04/2023,90319318,presencial,Oeste
...,...,...,...,...,...,...,...,...
2495,3496,245.0,E,312.81,25/04/2022,74480627,online,Norte
2496,3497,513.0,B,278.91,18/06/2024,81810460,online,Norte
2497,3498,NaN,C,80.55,27/05/2024,18684931,venta telefónica,Norte
2498,3499,896.0,A,93.44,16/02/2020,76712135,presencial,Sur
2499,3500,2234.0,B,211.20,13/09/2021,33523570,online,Sur

In [219]:
df3_drop

      id_orden        tipo_venta region_de_venta  porcentaje_pago
0         1001        presencial            Este              8.0
1         1002            online           Norte             12.0
2         1003            online            Este             10.0
3         1004        presencial            Este              8.0
4         1005        presencial           Oeste              7.0
...        ...               ...             ...              ...
2495      3496            online           Norte             12.0
2496      3497            online           Norte             12.0
2497      3498  venta telefónica           Norte              5.0
2498      3499        presencial             Sur              9.0
2499      3500            online             Sur             11.0

[2500 rows x 4 columns]

# DATOS DUPLICADOS

In [189]:
num_filas_duplicadas=df1_drop.duplicated().sum()
print(f'La cantidad de dulpicados en el conjunto de datos 1 es de {num_filas_duplicadas}')

La cantidad de dulpicados en el conjunto de datos 1 es de 99

In [190]:
num_filas_duplicadas=df2_drop.duplicated().sum()
print(f'La cantidad de dulpicados en el conjunto de datos 2 es de {num_filas_duplicadas}')

La cantidad de dulpicados en el conjunto de datos 2 es de 0

In [218]:
num_filas_duplicadas=df3_drop.duplicated().sum()
print(f'La cantidad de dulpicados en el conjunto de datos 3 es de {num_filas_duplicadas}')

La cantidad de dulpicados en el conjunto de datos 3 es de 0

In [192]:
df1_duplicated=num_filas_duplicadas=df1_drop.drop_duplicates()
df1_duplicated

,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra
0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022
2,3.0,Pedro,Pérez,10/06/1976,Cartagena,22/02/2022,04/04/2022
3,4.0,Juan,López,17/04/1993,Cartagena,25/01/2022,07/03/2022
4,5.0,Elena,Pérez,21/07/2000,Barranquilla,15/02/2022,28/03/2022
...,...,...,...,...,...,...,...
2495,2496.0,Luis,Pérez,18/02/1982,Cartagena,04/01/2022,17/03/2022
2496,2497.0,Ana,Rodríguez,19/05/2001,Bogotá,12/03/2022,07/01/2022
2497,2498.0,Elena,López,13/08/1959,Bogotá,16/03/2022,14/03/2022
2498,2499.0,Rosa,Rodríguez,09/06/1954,Cali,04/01/2022,23/03/2022
2499,2500.0,Pedro,Gómez,18/05/1979,Bogotá,19/01/2022,21/01/2022

In [193]:
num_filas_duplicadas=df1_duplicated.duplicated().sum()
print(f'La cantidad de dulpicados en el conjunto de datos 1 es de {num_filas_duplicadas}')

La cantidad de dulpicados en el conjunto de datos 1 es de 0

In [194]:
df1_duplicated.head(2)

,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra
0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022

In [195]:
df1_duplicated.shape

(2401, 7)

In [196]:
df1_duplicated_1=df1_duplicated.drop_duplicates(subset=['ciudad'])
df1_duplicated_1

,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra
0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022
2,3.0,Pedro,Pérez,10/06/1976,Cartagena,22/02/2022,04/04/2022
5,6.0,Rosa,Sánchez,07/05/1954,Medellín,31/01/2022,05/02/2022
25,26.0,Luis,Ramírez,03/05/1990,Cali,29/01/2022,11/03/2022
100,101.0,Rosa,López,24/05/2000,NaN,19/02/2022,03/03/2022

In [197]:
df1_drop=df1_duplicated
df1_drop

,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra
0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022
2,3.0,Pedro,Pérez,10/06/1976,Cartagena,22/02/2022,04/04/2022
3,4.0,Juan,López,17/04/1993,Cartagena,25/01/2022,07/03/2022
4,5.0,Elena,Pérez,21/07/2000,Barranquilla,15/02/2022,28/03/2022
...,...,...,...,...,...,...,...
2495,2496.0,Luis,Pérez,18/02/1982,Cartagena,04/01/2022,17/03/2022
2496,2497.0,Ana,Rodríguez,19/05/2001,Bogotá,12/03/2022,07/01/2022
2497,2498.0,Elena,López,13/08/1959,Bogotá,16/03/2022,14/03/2022
2498,2499.0,Rosa,Rodríguez,09/06/1954,Cali,04/01/2022,23/03/2022
2499,2500.0,Pedro,Gómez,18/05/1979,Bogotá,19/01/2022,21/01/2022

In [198]:
df1_drop['fecha_nacimiento']=pd.to_datetime(df1_drop['fecha_nacimiento'],format='%d/%m/%Y')
df1_drop['fecha_registro']=pd.to_datetime(df1_drop['fecha_registro'],format='%d/%m/%Y')
df1_drop['ultima_compra']=pd.to_datetime(df1_drop['ultima_compra'],format='%d/%m/%Y')
df1_drop

C:\Users\soyju\AppData\Local\Temp\ipykernel_7400\3393979202.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1_drop['fecha_nacimiento']=pd.to_datetime(df1_drop['fecha_nacimiento'],format='%d/%m/%Y')
C:\Users\soyju\AppData\Local\Temp\ipykernel_7400\3393979202.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1_drop['fecha_registro']=pd.to_datetime(df1_drop['fecha_registro'],format='%d/%m/%Y')
C:\Users\soyju\AppData\Local\Temp\ipykernel_7400\3393979202.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1_drop['ultima_compra']=pd.to_datetime(df1_drop['ultima_compra'],format='%d/%m/%Y')

,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra
0,1.0,Ana,Díaz,2000-01-06,Bogotá,2022-01-19,2022-02-14
1,2.0,Carlos,López,1980-08-02,Barranquilla,2022-01-21,2022-02-15
2,3.0,Pedro,Pérez,1976-06-10,Cartagena,2022-02-22,2022-04-04
3,4.0,Juan,López,1993-04-17,Cartagena,2022-01-25,2022-03-07
4,5.0,Elena,Pérez,2000-07-21,Barranquilla,2022-02-15,2022-03-28
...,...,...,...,...,...,...,...
2495,2496.0,Luis,Pérez,1982-02-18,Cartagena,2022-01-04,2022-03-17
2496,2497.0,Ana,Rodríguez,2001-05-19,Bogotá,2022-03-12,2022-01-07
2497,2498.0,Elena,López,1959-08-13,Bogotá,2022-03-16,2022-03-14
2498,2499.0,Rosa,Rodríguez,1954-06-09,Cali,2022-01-04,2022-03-23
2499,2500.0,Pedro,Gómez,1979-05-18,Bogotá,2022-01-19,2022-01-21

In [199]:
fecha_hoy=pd.Timestamp.now()
fecha_hoy

Timestamp('2024-08-26 19:46:35.795285')

In [200]:
df1_drop['edad']=(fecha_hoy-df1_drop['fecha_nacimiento']).dt.days//365
df1_drop.head(2)

C:\Users\soyju\AppData\Local\Temp\ipykernel_7400\1074266278.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1_drop['edad']=(fecha_hoy-df1_drop['fecha_nacimiento']).dt.days//365

,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra,edad
0,1.0,Ana,Díaz,2000-01-06,Bogotá,2022-01-19,2022-02-14,24.0
1,2.0,Carlos,López,1980-08-02,Barranquilla,2022-01-21,2022-02-15,44.0

In [201]:
df2_drop['fecha_orden']=pd.to_datetime(df2_drop['fecha_orden'],format='%d/%m/%Y')
df2_drop.head(2)

,id_orden,id_cliente,producto,monto_de_compra,fecha_orden,identificacion,tipo_venta,region
0,1001,273.0,A,300.70,2022-10-31,43453698,presencial,Este
1,1002,1468.0,B,106.56,2021-06-07,27299420,online,Norte

In [204]:
df1_drop['ciudad'].unique()

array(['Bogotá', 'Barranquilla', 'Cartagena', 'Medellín', 'Cali', nan],
      dtype=object)

# AGRUPACIÓN DE DATOS

In [215]:
grupo=df1_drop.groupby(['ciudad','nombre']).size().reset_index(name='Cantidad')
grupo

          ciudad  nombre  Cantidad
0   Barranquilla     Ana        59
1   Barranquilla  Carlos        55
2   Barranquilla   Diego        44
3   Barranquilla   Elena        38
4   Barranquilla    Juan        51
5   Barranquilla    Luis        53
6   Barranquilla   Marta        39
7   Barranquilla   Pedro        38
8   Barranquilla    Rosa        45
9   Barranquilla   Sofía        59
10        Bogotá     Ana        44
11        Bogotá  Carlos        48
12        Bogotá   Diego        43
13        Bogotá   Elena        54
14        Bogotá    Juan        49
15        Bogotá    Luis        42
16        Bogotá   Marta        48
17        Bogotá   Pedro        52
18        Bogotá    Rosa        47
19        Bogotá   Sofía        45
20          Cali     Ana        48
21          Cali  Carlos        43
22          Cali   Diego        43
23          Cali   Elena        49
24          Cali    Juan        57
25          Cali    Luis        43
26          Cali   Marta        38
27          Cali   Pedro        37
28          Cali    Rosa        49
29          Cali   Sofía        42
30     Cartagena     Ana        45
31     Cartagena  Carlos        30
32     Cartagena   Diego        43
33     Cartagena   Elena        51
34     Cartagena    Juan        53
35     Cartagena    Luis        56
36     Cartagena   Marta        44
37     Cartagena   Pedro        40
38     Cartagena    Rosa        40
39     Cartagena   Sofía        56
40      Medellín     Ana        45
41      Medellín  Carlos        41
42      Medellín   Diego        39
43      Medellín   Elena        46
44      Medellín    Juan        33
45      Medellín    Luis        53
46      Medellín   Marta        48
47      Medellín   Pedro        44
48      Medellín    Rosa        49
49      Medellín   Sofía        41

In [216]:
grupo=df2_drop.groupby(['producto']).size().reset_index(name='Cantidad')
grupo

  producto  Cantidad
0        A       492
1        B       509
2        C       508
3        D       533
4        E       458

In [220]:
grupo=df3_drop.groupby(['tipo_venta','region_de_venta']).size().reset_index(name='Cantidad')
grupo

          tipo_venta region_de_venta  Cantidad
0             online            Este       137
1             online           Norte       162
2             online           Oeste       148
3             online             Sur       136
4         presencial            Este       180
5         presencial           Norte       162
6         presencial           Oeste       161
7         presencial             Sur       151
8      venta directa            Este       141
9      venta directa           Norte       146
10     venta directa           Oeste       158
11     venta directa             Sur       151
12  venta telefónica            Este       158
13  venta telefónica           Norte       179
14  venta telefónica           Oeste       169
15  venta telefónica             Sur       161

In [221]:
grupo1=grupo[grupo['region_de_venta']=='Este']
grupo1

          tipo_venta region_de_venta  Cantidad
0             online            Este       137
4         presencial            Este       180
8      venta directa            Este       141
12  venta telefónica            Este       158

# CRUCE DE DATOS (MERGGE - JOIN)

In [222]:
df1_drop.head(2)

,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra,edad,localizacion
0,1.0,Ana,Díaz,2000-01-06,Bogotá,2022-01-19,2022-02-14,24.0,Envio sin cobro
1,2.0,Carlos,López,1980-08-02,Barranquilla,2022-01-21,2022-02-15,44.0,Envio con cobro

In [225]:
df2_drop.head(2)

,id_orden,id_cliente,producto,monto_de_compra,fecha_orden,identificacion,tipo_venta,region
0,1001,273.0,A,300.70,2022-10-31,43453698,presencial,Este
1,1002,1468.0,B,106.56,2021-06-07,27299420,online,Norte

In [224]:
df3_drop.head(2)

   id_orden  tipo_venta region_de_venta  porcentaje_pago
0      1001  presencial            Este              8.0
1      1002      online           Norte             12.0

In [226]:
merge1=pd.merge(df1_drop,df2_drop,on='id_cliente',how='inner')
merge1

,id_cliente,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra,edad,localizacion,id_orden,producto,monto_de_compra,fecha_orden,identificacion,tipo_venta,region
0,1.0,Ana,Díaz,2000-01-06,Bogotá,2022-01-19,2022-02-14,24.0,Envio sin cobro,1917,B,289.02,2020-12-09,76863340,venta telefónica,Este
1,1.0,Ana,Díaz,2000-01-06,Bogotá,2022-01-19,2022-02-14,24.0,Envio sin cobro,2125,A,281.66,2024-02-14,19699709,venta telefónica,Oeste
2,6.0,Rosa,Sánchez,1954-05-07,Medellín,2022-01-31,2022-02-05,70.0,Envio con cobro,2929,B,476.79,2022-03-08,25718434,venta directa,Norte
3,9.0,Sofía,Martínez,1994-09-23,Barranquilla,2022-01-22,2022-03-27,29.0,Envio con cobro,1462,E,398.51,2020-12-05,21384959,venta directa,Oeste
4,12.0,Sofía,Sánchez,1960-03-04,Barranquilla,2022-02-07,2022-04-01,64.0,Envio con cobro,3105,B,393.82,2021-06-11,11968753,venta telefónica,Oeste
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2495,2497.0,Ana,Rodríguez,2001-05-19,Bogotá,2022-03-12,2022-01-07,23.0,Envio sin cobro,3488,E,319.21,2022-08-21,53443098,venta directa,Este
2496,2498.0,Elena,López,1959-08-13,Bogotá,2022-03-16,2022-03-14,65.0,Envio sin cobro,1394,E,129.93,2022-09-21,43837538,venta telefónica,Oeste
2497,2498.0,Elena,López,1959-08-13,Bogotá,2022-03-16,2022-03-14,65.0,Envio sin cobro,2118,B,485.34,2023-08-23,49821098,venta directa,Oeste
2498,2500.0,Pedro,Gómez,1979-05-18,Bogotá,2022-01-19,2022-01-21,45.0,Envio sin cobro,2153,D,494.56,2024-07-09,30885322,venta directa,Norte
2499,2500.0,Pedro,Gómez,1979-05-18,Bogotá,2022-01-19,2022-01-21,45.0,Envio sin cobro,3282,D,83.78,2020-01-25,69448520,venta telefónica,Este

In [228]:
df_prueba=df1_drop.rename(columns={'id_cliente':'id_cliente_otro'})
df_prueba

,id_cliente_otro,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra,edad,localizacion
0,1.0,Ana,Díaz,2000-01-06,Bogotá,2022-01-19,2022-02-14,24.0,Envio sin cobro
1,2.0,Carlos,López,1980-08-02,Barranquilla,2022-01-21,2022-02-15,44.0,Envio con cobro
2,3.0,Pedro,Pérez,1976-06-10,Cartagena,2022-02-22,2022-04-04,48.0,Envio con cobro
3,4.0,Juan,López,1993-04-17,Cartagena,2022-01-25,2022-03-07,31.0,Envio con cobro
4,5.0,Elena,Pérez,2000-07-21,Barranquilla,2022-02-15,2022-03-28,24.0,Envio con cobro
...,...,...,...,...,...,...,...,...,...
2495,2496.0,Luis,Pérez,1982-02-18,Cartagena,2022-01-04,2022-03-17,42.0,Envio con cobro
2496,2497.0,Ana,Rodríguez,2001-05-19,Bogotá,2022-03-12,2022-01-07,23.0,Envio sin cobro
2497,2498.0,Elena,López,1959-08-13,Bogotá,2022-03-16,2022-03-14,65.0,Envio sin cobro
2498,2499.0,Rosa,Rodríguez,1954-06-09,Cali,2022-01-04,2022-03-23,70.0,Envio con cobro
2499,2500.0,Pedro,Gómez,1979-05-18,Bogotá,2022-01-19,2022-01-21,45.0,Envio sin cobro

In [229]:
merge2=pd.merge(df_prueba,df2_drop,left_on='id_cliente_otro',right_on='id_cliente', how='inner')
merge2.head(2)

,id_cliente_otro,nombre,apellidos,fecha_nacimiento,ciudad,fecha_registro,ultima_compra,edad,localizacion,id_orden,id_cliente,producto,monto_de_compra,fecha_orden,identificacion,tipo_venta,region
0,1.0,Ana,Díaz,2000-01-06,Bogotá,2022-01-19,2022-02-14,24.0,Envio sin cobro,1917,1.0,B,289.02,2020-12-09,76863340,venta telefónica,Este
1,1.0,Ana,Díaz,2000-01-06,Bogotá,2022-01-19,2022-02-14,24.0,Envio sin cobro,2125,1.0,A,281.66,2024-02-14,19699709,venta telefónica,Oeste